# Конфигурация Tesseract
TESSERACT_PATH  = 'D:\\Tesseract-OCR\\tesseract.exe'
TESSERACT_CONFIG = r'-c tessedit_char_whitelist=01234567890()*+-/=? --psm 6'

# Позиции на экране
PLAY_POS    = (1105, 858) # Кнопка "Играть" (x, y)
FOCUS_POS   = (1800, 500) # Пустое пространство для фокуса на окне (x, y)
INPUT_POS   = (1037, 910) # Поле ввода "Напишите сообщение..." (x, y)
LEVEL1_POS  = (1024, 800) # Кнопка "Ур. 1" (x, y)
BACK_POS    = (1096, 980) # Кнопка "Вернуться назад" (x, y)
EXPRESSION_REGION = ( # Регион скриншота выражения
    1039, 580, # x, y
    352, 132   # ширина, высота
)

# Позиции на экране в окне ввода каптчи
CAPTCHA_INPUT_POS = (934, 493) # Поле ввода каптчи (x, y)
CAPTCHA_REGION = ( # Регион проверки наличия каптчи
    730, 270, # x, y
    440, 120  # ширина, высота
)
CAPTCHA_PIXELS = ( # TODO: Точки для проверки наличия каптчи (x, y, (R, G, B))
    (770, 335, (81, 129, 184)),
    (1037, 331, (81, 129, 184)),
    (795, 489, (255, 255, 255)),
    (1098, 491, (255, 255, 255)),
)

# Замены для неверно распознанных цифр
REPLACEMENTS = {
    '=?': '', '’': '', ':': '', '`': '',
    'o': '0', 'O': '0',
    'l': '1',
    '¢': '6', 'b': '6',
    'n': '11', 'H': '11',
    '–': '-', '—': '-',
}

# Уровень игры по умолчанию
DEFAULT_LEVEL = 6